In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('Salary_Data.csv')
df.head()

   YearsExperience   Age  Salary
0              1.1  21.0   39343
1              1.3  21.5   46205
2              1.5  21.7   37731
3              2.0  22.0   43525
4              2.2  22.2   39891

In [3]:
df.shape

(30, 3)

In [4]:
df.dtypes

YearsExperience    float64
Age                float64
Salary               int64
dtype: object

In [5]:
# information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Age              30 non-null     float64
 2   Salary           30 non-null     int64
dtypes: float64(2), int64(1)
memory usage: 848.0 bytes

In [6]:
df.count()

YearsExperience    30
Age                30
Salary             30
dtype: int64

In [7]:
# memory usage
df.memory_usage()

Index              128
YearsExperience    240
Age                240
Salary             240
dtype: int64

In [8]:
df.memory_usage().sum()

848

In [9]:
# value counts
df['Age'].value_counts()

24.0    3
23.3    2
23.0    2
25.0    2
30.0    2
21.7    1
21.5    1
22.0    1
26.0    1
27.0    1
28.0    1
29.0    1
38.0    1
23.6    1
31.0    1
32.0    1
22.2    1
33.0    1
34.0    1
35.0    1
36.0    1
37.0    1
23.9    1
21.0    1
Name: Age, dtype: int64

## Statistical Operations

In [10]:
# Summary Statistics
df.describe()

       YearsExperience        Age         Salary
count        30.000000  30.000000      30.000000
mean          5.313333  27.216667   76003.000000
std           2.837888   5.161267   27414.429785
min           1.100000  21.000000   37731.000000
25%           3.200000  23.300000   56720.750000
50%           4.700000  25.000000   65237.000000
75%           7.700000  30.750000  100544.750000
max          10.500000  38.000000  122391.000000

In [11]:
## Statistical moments
df.mean()

YearsExperience        5.313333
Age                   27.216667
Salary             76003.000000
dtype: float64

In [12]:
df['Salary'].mean()

76003.0

In [13]:
df.mean(axis=1)[:5]

0    13121.700000
1    15409.266667
2    12584.733333
3    14516.333333
4    13305.133333
dtype: float64

In [14]:
## Variance
df.var()

YearsExperience    8.053609e+00
Age                2.663868e+01
Salary             7.515510e+08
dtype: float64

In [15]:
## standard deviation
df.std()

YearsExperience        2.837888
Age                    5.161267
Salary             27414.429785
dtype: float64

In [16]:
## Skewness
df.skew()

YearsExperience    0.379560
Age                0.730189
Salary             0.354120
dtype: float64

In [17]:
## Kutosis
df.kurtosis()

YearsExperience   -1.012212
Age               -0.765248
Salary            -1.295421
dtype: float64

In [18]:
df.max()

YearsExperience        10.5
Age                    38.0
Salary             122391.0
dtype: float64

In [19]:
df.min()

YearsExperience        1.1
Age                   21.0
Salary             37731.0
dtype: float64

In [20]:
df.median()

YearsExperience        4.7
Age                   25.0
Salary             65237.0
dtype: float64

In [21]:
## Correlation
df.corr()

                 YearsExperience       Age    Salary
YearsExperience         1.000000  0.987258  0.978242
Age                     0.987258  1.000000  0.974530
Salary                  0.978242  0.974530  1.000000